# SetClLS

## Description
Deprecated - will generate error. Use SetClLSN instead.

```pascal
PROCEDURE SetClLS(
				className : STRING;
				LS        : INTEGER);
```

```python

def vs.SetClLS(className, LS):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|
|LS|INTEGER|Line style index value.|

## Remarks
Deprecated - will generate error. Use SetClLSN instead. Original description was: Sets the line style of a specified class.

## Examples
```pascal
SetClLS('Property Parcels',-4);
```

## See Also
VS Functions:
SetClLSN

## Version
```diff
- SetClLS is obsolete as of Vectorworks 2013
```

Availability: from VectorWorks8.0
## Category
* Classes